tutorials/incompressible/simpleFoam/drivaerFastback/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

fields  (U);

direction       both;

seedSampleSet
{
    type            sphereRandom;
    centre          (4 0 0.7);
    radius          1;
    nPoints         30;
    axis x;
}

// ************************************************************************* //
